from matplotlib import pyplot as plt
from matplotlib import font_manager

my_font = font_manager.FontProperties(fname="C:\Windows\Fonts\msyh.ttc")
# 直方图绘制的是未经统计的数据，如果给出每组的数据了，就需要使用条形图绘制
a = [131, 98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107, 114, 119, 128, 121, 142, 127, 130, 124,
     101, 110, 116, 117, 110, 128, 128, 115, 99, 136, 126, 134, 95, 138, 117, 111, 78, 132, 124, 113, 150, 110, 117, 86,
     95, 144, 105, 126, 130, 126, 130, 126, 116, 123, 106, 112, 138, 123, 86, 101, 99, 136, 123, 117, 119, 105, 137,
     123, 128, 125, 104, 109, 134, 125, 127, 105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120, 114, 105, 115,
     132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134, 156, 106, 117, 127, 144, 139, 139, 119, 140, 83, 110, 102,
     123, 107, 143, 115, 136, 118, 139, 123, 112, 118, 125, 109, 119, 133, 112, 114, 122, 109, 106, 123, 116, 131, 127,
     115, 118, 112, 135, 115, 146, 137, 116, 103, 144, 83, 123, 111, 110, 111, 100, 154, 136, 100, 118, 119, 133, 134,
     106, 129, 126, 110, 111, 109, 141, 120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114, 125, 126, 114, 140, 103,
     130, 141, 117, 106, 114, 121, 114, 133, 137, 92, 121, 112, 146, 97, 137, 105, 98, 117, 112, 81, 97, 139, 113, 134,
     106, 144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110, 105, 129, 137, 112, 120, 113, 133, 112, 83, 94, 146,
     133, 101, 131, 116, 111, 84, 137, 115, 122, 106, 144, 109, 123, 116, 111, 111, 133, 150]

#计算组数
d=3#组距，根据下面的计算公式，最好取的组距可以被以下公式整除！
num_bins=(max(a)-min(a))//d#计算组数,//是取整计算
# 划分为20组数据
plt.hist(a, num_bins)
# 调整x轴的刻度
plt.xticks(range(min(a),max(a)+d,d))


plt.grid()
# b_16 = [15746,312,4497,319]
# b_15=[12357,156,2045,168]
# b_14=[2358,399,2358,362]

# 线条宽度
# bar_width=0.2
#
# x_14=list(range(len(a)))
# x_15=[i+bar_width for i in x_14]
# x_16=[i+bar_width*2 for i in x_14]

# plt.figure(figsize=(20, 8), dpi=80)  # 设置图形大小和清晰度
#
# plt.bar(range(len(a)), b_14,width=bar_width,label="9月14日")
# plt.bar(x_15, b_15,width=bar_width,label="9月15日")
# plt.bar(x_16, b_16,width=bar_width,label="9月16日")


# 图例
# plt.legend(loc="upper left", prop=my_font)


# plt.grid(alpha=0.3)
# 添加描述信息
# plt.xlabel("时间", fontproperties=my_font)
# plt.ylabel("温度", fontproperties=my_font)
# plt.title("3月和10月的气温", fontproperties=my_font)
#


plt.show()
